"""
Дан двумерный массив. Выведите элемент, находящийся в средней строке и в среднем столбце
"""
import numpy as np

arr = np.array([[7, 6, 7, 7, 1],
                [3, 3, 2, 8, 3],
                [2, 7, 5, 8, 2],
                [4, 7, 1, 5, 5],
                [8, 6, 6, 8, 9]])

print(arr[arr.shape[0] // 2, arr.shape[1] // 2])
