"""
Выведите индексы столбцов, среднее в которых выше, чем среднее по массиву в целом.
"""
import numpy as np

data = np.array([[8, 6, 5, 6],
                 [5, 9, 1, 9],
                 [8, 2, 6, 7],
                 [2, 7, 4, 4],
                 [6, 7, 6, 2],
                 [6, 9, 6, 1]])

print(*np.where(data.mean(0) > data.mean()))
