"""
Создайте с помощью np.ones() массив целых чисел размерностью 4x3 и выведите его
"""
import numpy as np

arr = np.ones((4, 3), dtype=np.int64)

print(arr)
