"""
Даны оценки 4-x школьников за четверть. Выведите мединанную оценку для каждого школьника.
"""
import numpy as np

marks = np.array([[4, 3, 4, 5, 4, 3, 2, 5],
                  [5, 5, 3, 5, 5, 4, 5, 4],
                  [4, 2, 4, 5, 2, 3, 4, 5],
                  [3, 4, 4, 3, 3, 2, 3, 2]])

print(np.median(marks, 1))
