"""
Дан одномерный массив. Выведите 3, 5, 1 элементы с помощью массива-индекса
"""
import numpy as np

a = np.array([10, 24,  3, 2,  1, 27])
print(a[np.array([3, 5, 1])])
