"""
Дан двумерный массив. Выведите элементы:

из строки 1 и столбца 2
из строки 0 и столбца -1
из строки 3 и столбца 2
"""
import numpy as np

a = np.array([[20, 20, 21, 14, 18],
              [18, 11, 3, 4, 5],
              [19, 16, 2, 1, 17],
              [22, 14, 8, 16, 11]])

i = np.array([1, 0, 3])
j = np.array([2, -1, 2])
print(a[i, j])
