"""
Дан двумерный массив. Выведите элементы из 5, 2, и последнего столбца
"""
import numpy as np

arr = np.array([[7, 8, 9, 10, 11, 12, 13],
                [14, 15, 16, 17, 18, 19, 20],
                [21, 22, 23, 24, 25, 26, 27],
                [28, 29, 30, 31, 32, 33, 34]])

print(arr[:, [5, 2, -1]])
