"""
Дан двумерный массив, выведите последний столбец
"""
import numpy as np

a = np.array([[20, 20, 21, 14, 18],
              [18, 11, 3, 4, 5],
              [19, 16, 2, 1, 17],
              [22, 14, 8, 16, 11]])

print(a[:, -1])
